<a href="https://colab.research.google.com/github/hashamuddin1/panda.github.io/blob/main/PANDAS2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **SERIES**

In [ ]:
import pandas as pd
#ONE DIMENSIONAL ARRAY IS CALLED "SERIES".
#MULTI-DIMENSIONAL ARRAY IS CALLED "DATA -FRAME".
a=pd.Series(["a","b","c"])
print(a)

0    a
1    b
2    c
dtype: object

In [ ]:
b=["hasham","azhar","amin","moin"]
c=pd.Series(b)
print(c)

0    hasham
1     azhar
2      amin
3      moin
dtype: object

In [ ]:
#IF WE WANT TO CHANGE INDEXING.
a=pd.Series(["hasham","azhar","amin","moin"],index=["a","b","c","d"])
print(a)

a    hasham
b     azhar
c      amin
d      moin
dtype: object

In [ ]:
#WHEN WE WILL GIVE EXTRA INDEX LABEL THEN IT WILL GENERATE AN ERROR
a=pd.Series(["hasham","amin"],index=["a","b","c"])#ERROR
print(a)#ERROR

In [ ]:
#WE CAN ALSO GIVE A DICTIONARY...KEYS WILL BECOME INDEX AND VALUES WILL BECOME VALUES.
a=pd.Series({"a":"hasham","b":"azhar","c":"amin","d":"moin"})
print(a)

a    hasham
b     azhar
c      amin
d      moin
dtype: object

In [ ]:
#IF WE WANT TO CHANGE THE ORDER OF INDEXING BY GIVE THE DICTIONARY.
a=pd.Series({"a":"hasham","b":"azhar","c":"moin","d":"amin"},index=["b","d","a","c"])
print(a)

b     azhar
d      amin
a    hasham
c      moin
dtype: object

In [ ]:
#WE CAN ALSO GIVE REPEATED INDEX VALUES
a=pd.Series({"a":"hasham","b":"azhar","c":"moin","d":"amin"},index=["b","b","a","a","c","d","a","c"])
print(a)

b     azhar
b     azhar
a    hasham
a    hasham
c      moin
d      amin
a    hasham
c      moin
dtype: object

In [ ]:
#IF WE WILL GIVE EXTRA INDEX SO NaN WILL BE THE VALUE..NaN MEANS NO VALUE NULL
a=pd.Series({"a":"hasham","b":"azhar"},index=["a","b","b","a","c"])
print(a)

a    hasham
b     azhar
b     azhar
a    hasham
c       NaN
dtype: object

In [ ]:
#WE CAN ALSO GIVE LIST,TUPLE AND DICTIONARY AS A VALUE BY USING DICTIONARY
a=pd.Series({"a":[1,2,3,4],"b":["a","b","c"],"c":(1,2,3,4),"d":{1:2,3:4}})
print(a)

a    [1, 2, 3, 4]
b       [a, b, c]
c    (1, 2, 3, 4)
d    {1: 2, 3: 4}
dtype: object

In [ ]:
#WHEN WE GIVE DUPLICATE KEY SO THEN LATEST KEY'S VALUE WILL BE PRINT
a=pd.Series({"a":"hasham","b":"azhar","a":"amin"})
print(a)

a     amin
b    azhar
dtype: object

In [ ]:
#WE CAN ALSO CHANGE THE ORDER OF INDEXING THROUGH DICTIONARY
a=pd.Series({"a":"hasham","b":"azhar","c":"amin","d":"moin"},index=["c","d","a","b","e"])
a#HERE e INDEX CONTAIN NO VALUE SO NaN WILLBE RETURN

c      amin
d      moin
a    hasham
b     azhar
e       NaN
dtype: object

In [ ]:
#ISNULL:IT WILL PRINT TRUE IN THE INDEX WHICH CONTAIN NaN VALUE
print(pd.isnull(a))

c    False
d    False
a    False
b    False
e     True
dtype: bool

In [ ]:
#NOTNULL:IT WILL PRINT TRUE IN INDEX WHICH DONOT CONTAIN NaN VALUE
print(pd.notnull(a))

c     True
d     True
a     True
b     True
e    False
dtype: bool

In [ ]:
#ARITHMETIC OPERATION
a=pd.Series([1,2,3,4,5])
print(a+5)
print(a-5)
print(a*5)
print(a/5)
print(a//5)

0     6
1     7
2     8
3     9
4    10
dtype: int64
0   -4
1   -3
2   -2
3   -1
4    0
dtype: int64
0     5
1    10
2    15
3    20
4    25
dtype: int64
0    0.2
1    0.4
2    0.6
3    0.8
4    1.0
dtype: float64
0    0
1    0
2    0
3    0
4    1
dtype: int64

In [ ]:
#INDEXING
a=pd.Series(["a","b","c","d","e"])
print(a[0])
print(a[3])
print(a[1])

a
d
b

In [ ]:
#WE CAN ALSO DO INDEXING BY INDEXING LABEL
a=pd.Series(["hasham","azhar","amin","moin"],index=["a","b","c","d"])
print(a["d"])
print(a["c"])
print(a["a"])
print(a["b"])

moin
amin
hasham
azhar

In [ ]:
#SLICING
a=pd.Series([4,3,6,7,8,1,2])
print(a[:2])
print(a[2:])
print(a[1:4])
print(a[1:5:2])

0    4
1    3
dtype: int64
2    6
3    7
4    8
5    1
6    2
dtype: int64
1    3
2    6
3    7
dtype: int64
1    3
3    7
dtype: int64

In [ ]:
#NaN VALUE + ANY VALUE=NaN VALUE
#NaN VALUE - ANY VALUE=NaN VALUE
#NaN VALUE * ANY VALUE=NaN VALUE
#NaN VALUE / ANY VALUE=NaN VALUE
#NaN VALUE // ANY VALUE=NaN VALUE
a=pd.Series([4,3,2,1,7])
b=pd.Series([5,4,3])
print(a+b)
print(a-b)
print(a*b)
print(a**b)
print(a/b)
print(a//b)

0    9.0
1    7.0
2    5.0
3    NaN
4    NaN
dtype: float64
0   -1.0
1   -1.0
2   -1.0
3    NaN
4    NaN
dtype: float64
0    20.0
1    12.0
2     6.0
3     NaN
4     NaN
dtype: float64
0    1024.0
1      81.0
2       8.0
3       1.0
4       NaN
dtype: float64
0    0.800000
1    0.750000
2    0.666667
3         NaN
4         NaN
dtype: float64
0    0.0
1    0.0
2    0.0
3    NaN
4    NaN
dtype: float64

In [ ]:
#DUPLICATED
#WHEN ANY OBJECT IS REPEATED, THEN TRUE WILL BE PRINT IN OUTPUT
a=pd.Series(["a","b","a","b","c"])
print(a.duplicated())

0    False
1    False
2     True
3     True
4    False
dtype: bool

In [ ]:
#TO VIEW JUST ARRAY
a=pd.Series(["a","b","a","b","c"])
print(a.array)

<PandasArray>
['a', 'b', 'a', 'b', 'c']
Length: 5, dtype: object

In [ ]:
#TO SEE INDEX
a=pd.Series(["a","b","a","b","c"],index=["x","y","z","w","yy"])
print(a.index)

Index(['x', 'y', 'z', 'w', 'yy'], dtype='object')

In [ ]:
#TO SEE VALUES 
a=pd.Series(["a","b","a","b","c"],index=["x","y","z","w","yy"])
print(a.values)

['a' 'b' 'a' 'b' 'c']

In [ ]:
#FANCY INDEXING
a=pd.Series([3,4,5,6,1,12],index=["a","b","c","d","e","f"])
print(a[["b","c","e"]])
#WE CAN ALSO GIVE REPEATED LABELS
print(a[["b","b","a","c"]])

b    4
c    5
e    1
dtype: int64
b    4
b    4
a    3
c    5
dtype: int64

In [ ]:
#BOOLEAN INDEXING
a=pd.Series([2,1,-5,-3,0])
print(a[a>0])
print(a[a<0])
print(a[a!=0])

0    2
1    1
dtype: int64
2   -5
3   -3
dtype: int64
0    2
1    1
2   -5
3   -3
dtype: int64

In [ ]:
#THE ORIGINAL ARRAY WILL REMAIN SAME
a

0    2
1    1
2   -5
3   -3
4    0
dtype: int64

In [ ]:
#TO SAVE THE CHANGES
b=a[a>0]
b

0    2
1    1
dtype: int64

In [ ]:
a=pd.Series([1,5,4,3,8,90])
a.index=["a","b","c","d","e","f"]
a

a     1
b     5
c     4
d     3
e     8
f    90
dtype: int64

In [ ]:
#IF WE WANT TO CHECK THAT WHETHER THIS OBJECT PRESENT IN SERIES ARRAY OR NOT
#IF IT IS PRESENT THEN TRUE WILL BE PRINT
#IF IT IS NOT PRESENT THEN FALSE WILL BE PRINT
a=pd.Series([4,3,2,1])
print(3 in a)
print(2 in a)
print(8 in a)
print("hasham" in a)

True
True
False
False

## **DATAFRAME**

In [ ]:
#MULTI-DIMENSION ARRAY IS CALLED DATAFRAME
#HORIZONTAL ROWS ARE CALLED ROWS
#VERTICAL COLUMN IS CALLED COLUMN
a=pd.DataFrame({"NAME":["HASHAM","AZHAR","AMIN","MOIN"],"AGE":[20,22,30,32]})
a

     NAME  AGE
0  HASHAM   20
1   AZHAR   22
2    AMIN   30
3    MOIN   32

In [ ]:
b=[]
for a in range(4):
  c=input("ENTER THE NAME: ")
  b.append(c)
d=pd.DataFrame({"NAME":b})
d

ENTER THE NAME: hasham
ENTER THE NAME: azhar
ENTER THE NAME: amin
ENTER THE NAME: moin

     NAME
0  hasham
1   azhar
2    amin
3    moin

In [ ]:
a=pd.DataFrame({"NAME":["HASHAM","AZHAR","AMIN","MOIN"],"AGE":[20,22,30,33]})
a

     NAME  AGE
0  HASHAM   20
1   AZHAR   22
2    AMIN   30
3    MOIN   33

In [ ]:
#HEAD:IT WILL PRINT TOP 5 ROWS
a=pd.DataFrame({"NAME":["AMIN","ASLAM","USAMA","BILAL","AZHAR","MOIN","HASHAM"],"AGE":[20,14,55,56,24,23,30]})
a.head()

    NAME  AGE
0   AMIN   20
1  ASLAM   14
2  USAMA   55
3  BILAL   56
4  AZHAR   24

In [ ]:
#BUT WE CAN ALSO GIVE THE NUMBER 
a.head(3)

    NAME  AGE
0   AMIN   20
1  ASLAM   14
2  USAMA   55

In [ ]:
#TAIL: IT WILL PRINT LAST 5 ROWS
a.tail()

     NAME  AGE
2   USAMA   55
3   BILAL   56
4   AZHAR   24
5    MOIN   23
6  HASHAM   30

In [ ]:
#WE CAN ALSO GIVE THE NUMBERS 
a.tail(3)

     NAME  AGE
4   AZHAR   24
5    MOIN   23
6  HASHAM   30

In [ ]:
#SIZE: IT WILL PRINT TOTAL NUMBERS OF OBJECTS
a.size

14

In [ ]:
#IT WILL PRONT SHAPE OF AN ARRAY
a.shape

(7, 2)

In [ ]:
#DESCRIBE: IT WILL PRINT A MASSIVE INFORMATION ABOUT ARRAY
a.describe()

             AGE
count   7.000000
mean   31.714286
std    16.938263
min    14.000000
25%    21.500000
50%    24.000000
75%    42.500000
max    56.000000

In [ ]:
#EXTRACTION OF DATA
#iloc=IT IS USED TO EXTRACT DATA AS A SLICING[ROW  ,COLUMN]
a=pd.DataFrame({"NAME":["HASHAM","AZHAR","AMIN","MOIN"],"AGE":[20,22,30,31],"CGPA":[3,3.2,3.4,3.6]})
a.iloc[1:3,1:3]

   AGE  CGPA
1   22   3.2
2   30   3.4

In [ ]:
a[1:3,1:]#ERROR BECAUSE OF INVALID SYNTAX

In [ ]:
#loc=IT IS ALSO USED FOR EXTRACTION OF DATA ,THE DIFFERENCE IS THAT WE SHOULD WRITE THE NAME OF THE COLUMN WHICH WE WANT TO EXTRACT AND IN THE ROW THE LAST NUMBER IS INCLUSIVE
a.loc[1:3,("NAME","CGPA")]

    NAME  CGPA
1  AZHAR   3.2
2   AMIN   3.4
3   MOIN   3.6

In [ ]:
#DROP:TO DROP ANY COLUMN OR ROW BUT ORIGINAL ARRAY WILL REMAIN SAME
#AXIS=1 FOR DROP THE COLUMN
#AXIS=0 FOR DROP THE ROWS
a.drop("NAME",axis=1)

   AGE  CGPA
0   20   3.0
1   22   3.2
2   30   3.4
3   31   3.6

In [ ]:
a#REMAIN AS  ORIGINAL

     NAME  AGE  CGPA
0  HASHAM   20   3.0
1   AZHAR   22   3.2
2    AMIN   30   3.4
3    MOIN   31   3.6

In [ ]:
a.drop([2,3],axis=0)#3 IS INCLUDED

     NAME  AGE  CGPA
0  HASHAM   20   3.0
1   AZHAR   22   3.2

## **STATISTICS**

In [ ]:
#IN SERIES
a=pd.Series([3,3,6,0,9,80,70])
a.mean()

24.428571428571427

In [ ]:
a.median()

6.0

In [ ]:
a.mode()

0    3
dtype: int64

In [ ]:
a.max()

80

In [ ]:
a.min()

0

In [ ]:
a.var()

1209.6190476190475

In [ ]:
a.std()

34.779578025316056

In [ ]:
#IN DATAFRAME
a=pd.DataFrame({"NAME":["HASHAM","AZHAR","AMIN","MOIN"],"AGE":[22,22,50,31],"GRADES":[88,55,66,99]})
a.mean()

AGE       31.25
GRADES    77.00
dtype: float64

In [ ]:
a.mode()

     NAME   AGE  GRADES
0    AMIN  22.0      55
1   AZHAR   NaN      66
2  HASHAM   NaN      88
3    MOIN   NaN      99

In [ ]:
a.median()

AGE       26.5
GRADES    77.0
dtype: float64

In [ ]:
a.max()

NAME      MOIN
AGE         50
GRADES      99
dtype: object

In [ ]:
a.std()

AGE       13.200379
GRADES    20.083160
dtype: float64

In [ ]:
a.var()

AGE       174.250000
GRADES    403.333333
dtype: float64

**EXTRA FUNCTIONS**

In [ ]:
#IF WE WANT TO SEE THAT WHICH VALUE PRESENT IN THAT COLUMN AND HOW MANY TIMES IT IS REPEATED
a[["NAME"]].value_counts()

NAME
MOIN      1
HASHAM    1
AZHAR     1
AMIN      1
dtype: int64

In [ ]:
a[["AGE"]].value_counts()

AGE
22     2
50     1
31     1
dtype: int64

## **SORTING**

In [ ]:
#SORTING
a.sort_values(by="NAME")#IT WILL PRINT IN ALPHABETICAL ORDER

     NAME  AGE  GRADES
2    AMIN   50      66
1   AZHAR   22      55
0  HASHAM   22      88
3    MOIN   31      99

In [ ]:
a.sort_values(by="AGE")#IT WILL PRINT IN INCREASING ORDER

     NAME  AGE  GRADES
0  HASHAM   22      88
1   AZHAR   22      55
3    MOIN   31      99
2    AMIN   50      66

In [ ]:
#BY DEFAULT IT WILL PRINT IN INCREASING ORDER
#BUT WE CAN ALSO PRINT IN DESCINDING ORDER
a.sort_values(by="NAME",ascending=False)

     NAME  AGE  GRADES
3    MOIN   31      99
0  HASHAM   22      88
1   AZHAR   22      55
2    AMIN   50      66

In [ ]:
a.sort_values(by="GRADES",ascending=False)

     NAME  AGE  GRADES
3    MOIN   31      99
0  HASHAM   22      88
2    AMIN   50      66
1   AZHAR   22      55